[
  {
    "player_name": "Will Howard",
    "trivia": "Will Howard was a highly-touted high school quarterback, but he was also a standout basketball player who received scholarship offers to play college basketball."
  },
  {
    "player_name": "Aaron Rodgers",
    "trivia": "Aaron Rodgers holds the NFL record for the highest touchdown-to-interception ratio in league history. He also famously taped potato chips to the bottom of his heels during footwork drills to force himself to stay on his toes."
  },
  {
    "player_name": "Mason Rudolph",
    "trivia": "Mason Rudolph was a record-setting quarterback at Oklahoma State, where he won the Johnny Unitas Golden Arm Award as a senior, an award given to the nation's top quarterback."
  },
  {
    "player_name": "Skylar Thompson",
    "trivia": "Skylar Thompson was a three-sport athlete in high school, excelling in football, basketball, and baseball. He also earned a black belt in taekwondo at a young age."
  },
  {
    "player_name": "Kenneth Gainwell",
    "trivia": "Kenneth Gainwell, before transferring to Memphis, was a highly successful high school quarterback who led his team to a state championship."
  },
  {
    "player_name": "Kaleb Johnson",
    "trivia": "Kaleb Johnson, a running back, was a top-tier track and field athlete in high school, where he competed in the 100-meter dash and the long jump."
  },
  {
    "player_name": "Jaylen Warren",
    "trivia": "Jaylen Warren earned a scholarship to Oklahoma State after spending time at Snow College, a junior college in Utah. He was an undrafted free agent who worked his way onto the Steelers' roster."
  },
  {
    "player_name": "Calvin Anderson",
    "trivia": "Calvin Anderson is a master of the Rubik's Cube and can solve it behind his back and blindfolded. He was the first professional athlete to become a brand ambassador for the Rubik's Cube company."
  },
  {
    "player_name": "Spencer Anderson",
    "trivia": "Spencer Anderson, an offensive lineman, played multiple positions on the offensive line during his college career at Maryland, showcasing his versatility."
  },
  {
    "player_name": "Troy Fautanu",
    "trivia": "Troy Fautanu, an offensive tackle, is of Samoan descent and his family has a strong tradition of producing football players."
  },
  {
    "player_name": "Zach Frazier",
    "trivia": "Zach Frazier was a four-time state champion wrestler in high school and set a school record with 159 career wins. His wrestling background is often credited with his success on the football field."
  },
  {
    "player_name": "Broderick Jones",
    "trivia": "Broderick Jones, a first-round draft pick, won two national championships as a starting offensive lineman at the University of Georgia."
  },
  {
    "player_name": "Ryan McCollum",
    "trivia": "Ryan McCollum, a center, was a team captain at Texas A&M and was a finalist for the Rimington Trophy, which is awarded to the nation's best college center."
  },
  {
    "player_name": "Mason McCormick",
    "trivia": "Mason McCormick, a guard, was a four-year starter at South Dakota State and was a key part of an offensive line that helped the team win a national championship."
  },
  {
    "player_name": "Andrus Peat",
    "trivia": "Andrus Peat is a three-time Pro Bowl selection and was a first-round draft pick in the 2015 NFL Draft. His father, Todd Peat, also played in the NFL."
  },
  {
    "player_name": "Isaac Seumalo",
    "trivia": "Isaac Seumalo is of Samoan descent, and his father, Joe Seumalo, is a long-time college football coach."
  },
  {
    "player_name": "Pat Freiermuth",
    "trivia": "Pat Freiermuth was nicknamed 'Baby Gronk' by his teammates due to his physical playing style and resemblance to tight end Rob Gronkowski."
  },
  {
    "player_name": "Jonnu Smith",
    "trivia": "Jonnu Smith, a tight end, was a college teammate of New England Patriots quarterback Mac Jones at Florida International."
  },
  {
    "player_name": "Darnell Washington",
    "trivia": "Darnell Washington, a tight end, was a five-star recruit coming out of high school and committed to Georgia at the Under Armour All-America Game."
  },
  {
    "player_name": "Connor Heyward",
    "trivia": "Connor Heyward is the younger brother of Steelers defensive tackle Cameron Heyward. Their father, Craig 'Ironhead' Heyward, was also a Pro Bowl running back in the NFL."
  },
  {
    "player_name": "Calvin Austin III",
    "trivia": "Calvin Austin III was a star track and field athlete at Memphis, where he set school records in the 60-meter and 200-meter indoor dashes."
  },
  {
    "player_name": "DK Metcalf",
    "trivia": "DK Metcalf is one of only two players in NFL history, along with Randy Moss, with 50 receptions, 900 yards and five touchdowns in each of their first six seasons."
  },
  {
    "player_name": "Scotty Miller",
    "trivia": "Scotty Miller won a Super Bowl with the Tampa Bay Buccaneers in Super Bowl LV. He was a walk-on at Bowling Green and finished his college career with 21 touchdowns."
  },
  {
    "player_name": "Ben Skowronek",
    "trivia": "Ben Skowronek won Super Bowl LVI with the Los Angeles Rams. He is a distant cousin of the 1947 Heisman Trophy winner Johnny Lujack."
  },
  {
    "player_name": "Roman Wilson",
    "trivia": "Roman Wilson, a wide receiver, was a key player on the Michigan Wolverines' 2023 national championship team."
  },
  {
    "player_name": "Keeanu Benton",
    "trivia": "Keeanu Benton, a defensive tackle, was a two-time state champion wrestler in high school in Wisconsin, compiling a record of 90-1."
  },
  {
    "player_name": "Yahya Black",
    "trivia": "Yahya Black was a standout at Iowa, where he was named to the All-Big Ten Freshman team in 2021."
  },
  {
    "player_name": "Daniel Ekuale",
    "trivia": "Daniel Ekuale, a defensive tackle, is of Samoan descent and played college football at Washington State."
  },
  {
    "player_name": "Derrick Harmon",
    "trivia": "Derrick Harmon, a defensive lineman, was a highly productive player at Michigan State where he earned All-Big Ten honors."
  },
  {
    "player_name": "Cameron Heyward",
    "trivia": "Cameron Heyward has been selected as a team captain for the Steelers for ten consecutive seasons, which is a franchise record. His father was former NFL running back Craig 'Ironhead' Heyward."
  },
  {
    "player_name": "Logan Lee",
    "trivia": "Logan Lee was an accomplished wrestler in high school and won a state championship. He was a walk-on at Iowa and earned a scholarship."
  },
  {
    "player_name": "Isaiahh Loudermilk",
    "trivia": "Isaiahh Loudermilk, a defensive end, played his college football at Wisconsin, where he was a key member of a stout defense."
  },
  {
    "player_name": "Esezi Otomewo",
    "trivia": "Esezi Otomewo, a defensive lineman, was born in Minnesota to Nigerian parents. He was an Academic All-Big Ten selection while at the University of Minnesota."
  },
  {
    "player_name": "Carson Bruener",
    "trivia": "Carson Bruener, a linebacker, was a two-time captain at Washington and was a key part of their defense that made a run to the national championship game."
  },
  {
    "player_name": "Malik Harrison",
    "trivia": "Malik Harrison, a linebacker, was a multi-sport athlete in high school, playing basketball and running track in addition to football."
  },
  {
    "player_name": "Nick Herbig",
    "trivia": "Nick Herbig, a linebacker, is the younger brother of former NFL offensive lineman Nate Herbig. He was a two-time first-team All-Big Ten selection at Wisconsin."
  },
  {
    "player_name": "Alex Highsmith",
    "trivia": "Alex Highsmith was a walk-on at Charlotte before earning a scholarship and becoming one of the most productive pass rushers in college football."
  },
  {
    "player_name": "Cole Holcomb",
    "trivia": "Cole Holcomb was a star linebacker at North Carolina, where he led the team in tackles for three consecutive seasons."
  },
  {
    "player_name": "Patrick Queen",
    "trivia": "Patrick Queen was a key member of the LSU Tigers' national championship team in 2019. He was named the Defensive MVP of the College Football Playoff National Championship."
  },
  {
    "player_name": "T.J. Watt",
    "trivia": "T.J. Watt is the younger brother of former NFL defensive stars J.J. Watt and Derek Watt. He tied the NFL's single-season sack record with 22.5 sacks in 2021."
  },
  {
    "player_name": "Jack Sawyer",
    "trivia": "Jack Sawyer, a linebacker, was a five-star recruit coming out of high school and was a highly-touted prospect."
  },
  {
    "player_name": "Payton Wilson",
    "trivia": "Payton Wilson, a linebacker, was an All-American at North Carolina State and was the winner of the Chuck Bednarik Award as the nation's best defensive player in 2023."
  },
  {
    "player_name": "Brandin Echols",
    "trivia": "Brandin Echols was a state champion in the long jump in high school and also played basketball."
  },
  {
    "player_name": "Chuck Clark",
    "trivia": "Chuck Clark was originally drafted by the Baltimore Ravens, the Steelers' rival, and spent his first six seasons with the team before joining the Steelers."
  },
  {
    "player_name": "DeShon Elliott",
    "trivia": "DeShon Elliott, a safety, was an All-American at Texas and was a finalist for the Jim Thorpe Award, given to the nation's best defensive back."
  },
  {
    "player_name": "Donte Kent",
    "trivia": "Donte Kent, a cornerback, was a standout at Central Michigan where he earned All-MAC honors."
  },
  {
    "player_name": "Miles Killebrew",
    "trivia": "Miles Killebrew, a safety and special teams ace, was named to the Pro Bowl as a special teams player in 2021 and 2023."
  },
  {
    "player_name": "Joey Porter Jr.",
    "trivia": "Joey Porter Jr. is the son of former Steelers linebacker and Super Bowl champion Joey Porter Sr. His father also coached for the Steelers."
  },
  {
    "player_name": "Jalen Ramsey",
    "trivia": "Jalen Ramsey is a three-time All-Pro and a six-time Pro Bowl selection. He was a two-sport athlete at Florida State, also competing in track and field where he won a national championship in the long jump."
  },
  {
    "player_name": "Darius Slay",
    "trivia": "Darius Slay, a six-time Pro Bowl cornerback, is nicknamed 'Big Play Slay' for his ability to make game-changing plays."
  },
  {
    "player_name": "Juan Thornhill",
    "trivia": "Juan Thornhill won two Super Bowls with the Kansas City Chiefs before signing with the Cleveland Browns and then the Steelers."
  },
  {
    "player_name": "Chris Boswell",
    "trivia": "Chris Boswell's 59-yard field goal in 2022 is the longest in Steelers franchise history."
  },
  {
    "player_name": "Corliss Waitman",
    "trivia": "Corliss Waitman was born in Ghent, Belgium, and is one of the few NFL players to be born in that country."
  },
  {
    "player_name": "Christian Kuntz",
    "trivia": "Christian Kuntz was a dominant college linebacker at Duquesne, where he set a school record with 30.5 sacks. He later transitioned to long snapper in order to have a better chance at making an NFL roster."
  }
]
